results/4-loadtest/ibm_results/ibm_go_400.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/go_matrix.json
  2 threads and 400 connections
  Thread calibration: mean lat.: 380.095ms, rate sampling interval: 1684ms
  Thread calibration: mean lat.: 668.592ms, rate sampling interval: 2627ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.03s     9.92s   44.53s    80.43%
    Req/Sec   218.09    129.81   539.00     72.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  456.96ms
 75.000%   13.07s 
 90.000%   23.89s 
 99.000%   34.64s 
 99.900%   41.62s 
 99.990%   44.53s 
 99.999%   44.56s 
100.000%   44.56s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     123.839     0.000000            1         1.00
     218.623     0.100000         2156         1.11
     240.383     0.200000         4322         1.25
     265.983     0.300000         6488         1.43
     337.151     0.400000         8624         1.67
     456.959     0.500000        10785         2.00
     494.079     0.550000        11859         2.22
    2410.495     0.600000        12936         2.50
    5963.775     0.650000        14014         2.86
    9576.447     0.700000        15092         3.33
   13074.431     0.750000        16173         4.00
   14893.055     0.775000        16714         4.44
   16678.911     0.800000        17249         5.00
   18513.919     0.825000        17792         5.71
   20267.007     0.850000        18328         6.67
   22036.479     0.875000        18866         8.00
   22953.983     0.887500        19134         8.89
   23887.871     0.900000        19407        10.00
   24805.375     0.912500        19677        11.43
   25772.031     0.925000        19943        13.33
   26722.303     0.937500        20214        16.00
   27262.975     0.943750        20347        17.78
   27820.031     0.950000        20485        20.00
   28426.239     0.956250        20618        22.86
   29032.447     0.962500        20754        26.67
   29884.415     0.968750        20889        32.00
   30343.167     0.971875        20954        35.56
   30818.303     0.975000        21021        40.00
   31506.431     0.978125        21088        45.71
   31997.951     0.981250        21155        53.33
   32767.999     0.984375        21225        64.00
   33112.063     0.985938        21256        71.11
   33718.271     0.987500        21291        80.00
   34308.095     0.989062        21325        91.43
   34799.615     0.990625        21358       106.67
   35520.511     0.992188        21392       128.00
   35749.887     0.992969        21410       142.22
   36077.567     0.993750        21426       160.00
   36470.783     0.994531        21442       182.86
   37060.607     0.995313        21461       213.33
   37683.199     0.996094        21475       256.00
   38010.879     0.996484        21484       284.44
   38600.703     0.996875        21492       320.00
   38830.079     0.997266        21501       365.71
   39485.439     0.997656        21509       426.67
   39878.655     0.998047        21517       512.00
   40402.943     0.998242        21522       568.89
   40566.783     0.998437        21526       640.00
   40828.927     0.998633        21530       731.43
   41353.215     0.998828        21534       853.33
   41680.895     0.999023        21538      1024.00
   42008.575     0.999121        21543      1137.78
   42008.575     0.999219        21543      1280.00
   42467.327     0.999316        21545      1462.86
   42795.007     0.999414        21547      1706.67
   42860.543     0.999512        21551      2048.00
   42860.543     0.999561        21551      2275.56
   42860.543     0.999609        21551      2560.00
   42893.311     0.999658        21552      2925.71
   42926.079     0.999707        21553      3413.33
   43679.743     0.999756        21555      4096.00
   43679.743     0.999780        21555      4551.11
   43679.743     0.999805        21555      5120.00
   43712.511     0.999829        21556      5851.43
   43712.511     0.999854        21556      6826.67
   44531.711     0.999878        21557      8192.00
   44531.711     0.999890        21557      9102.22
   44531.711     0.999902        21557     10240.00
   44564.479     0.999915        21559     11702.86
   44564.479     1.000000        21559          inf
#[Mean    =     7026.635, StdDeviation   =     9921.413]
#[Max     =    44531.712, Total count    =        21559]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23374 requests in 1.00m, 20.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 3452
Requests/sec:    388.34
Transfer/sec:    345.49KB