results/4-loadtest/ibm_results/ibm_node_1000.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/node_matrix.json
  2 threads and 1000 connections
  Thread calibration: mean lat.: 442.348ms, rate sampling interval: 2040ms
  Thread calibration: mean lat.: 439.123ms, rate sampling interval: 2002ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   276.52ms  116.58ms   1.41s    74.47%
    Req/Sec   498.36     21.93   564.00     84.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  251.65ms
 75.000%  313.60ms
 90.000%  442.88ms
 99.000%  693.76ms
 99.900%  977.92ms
 99.990%    1.25s 
 99.999%    1.41s 
100.000%    1.41s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     124.159     0.000000            1         1.00
     157.823     0.100000         4726         1.11
     181.759     0.200000         9442         1.25
     210.303     0.300000        14169         1.43
     232.703     0.400000        18871         1.67
     251.647     0.500000        23586         2.00
     260.735     0.550000        25967         2.22
     271.359     0.600000        28343         2.50
     283.391     0.650000        30683         2.86
     296.447     0.700000        33044         3.33
     313.599     0.750000        35380         4.00
     324.095     0.775000        36567         4.44
     340.479     0.800000        37747         5.00
     361.471     0.825000        38928         5.71
     388.351     0.850000        40100         6.67
     417.279     0.875000        41278         8.00
     429.311     0.887500        41868         8.89
     442.879     0.900000        42458        10.00
     456.703     0.912500        43044        11.43
     469.247     0.925000        43639        13.33
     484.607     0.937500        44229        16.00
     494.079     0.943750        44519        17.78
     504.575     0.950000        44816        20.00
     518.655     0.956250        45110        22.86
     530.431     0.962500        45415        26.67
     546.303     0.968750        45702        32.00
     553.983     0.971875        45845        35.56
     570.879     0.975000        45993        40.00
     589.311     0.978125        46142        45.71
     619.007     0.981250        46287        53.33
     647.679     0.984375        46439        64.00
     661.503     0.985938        46508        71.11
     673.791     0.987500        46584        80.00
     683.519     0.989062        46658        91.43
     698.367     0.990625        46729       106.67
     709.119     0.992188        46807       128.00
     710.143     0.992969        46850       142.22
     711.167     0.993750        46891       160.00
     712.191     0.994531        46915       182.86
     714.239     0.995313        46957       213.33
     728.575     0.996094        46987       256.00
     737.791     0.996484        47007       284.44
     750.591     0.996875        47025       320.00
     769.023     0.997266        47044       365.71
     796.159     0.997656        47061       426.67
     834.047     0.998047        47079       512.00
     875.519     0.998242        47089       568.89
     908.287     0.998437        47098       640.00
     929.791     0.998633        47107       731.43
     955.391     0.998828        47116       853.33
     978.431     0.999023        47125      1024.00
     996.863     0.999121        47130      1137.78
    1026.559     0.999219        47135      1280.00
    1033.727     0.999316        47139      1462.86
    1055.743     0.999414        47144      1706.67
    1071.103     0.999512        47148      2048.00
    1081.343     0.999561        47151      2275.56
    1085.439     0.999609        47153      2560.00
    1097.727     0.999658        47155      2925.71
    1162.239     0.999707        47158      3413.33
    1179.647     0.999756        47160      4096.00
    1189.887     0.999780        47161      4551.11
    1203.199     0.999805        47162      5120.00
    1213.439     0.999829        47163      5851.43
    1231.871     0.999854        47165      6826.67
    1252.351     0.999878        47166      8192.00
    1252.351     0.999890        47166      9102.22
    1281.023     0.999902        47168     10240.00
    1281.023     0.999915        47168     11702.86
    1281.023     0.999927        47168     13653.33
    1290.239     0.999939        47169     16384.00
    1290.239     0.999945        47169     18204.44
    1290.239     0.999951        47169     20480.00
    1290.239     0.999957        47169     23405.71
    1309.695     0.999963        47170     27306.67
    1309.695     0.999969        47170     32768.00
    1309.695     0.999973        47170     36408.89
    1309.695     0.999976        47170     40960.00
    1309.695     0.999979        47170     46811.43
    1409.023     0.999982        47171     54613.33
    1409.023     1.000000        47171          inf
#[Mean    =      276.518, StdDeviation   =      116.579]
#[Max     =     1408.000, Total count    =        47171]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58683 requests in 1.00m, 50.98MB read
Requests/sec:    978.00
Transfer/sec:    870.08KB