results/4-loadtest/ibm_results/ibm_python_100.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/python_matrix.json
  2 threads and 100 connections
  Thread calibration: mean lat.: 615.332ms, rate sampling interval: 1801ms
  Thread calibration: mean lat.: 767.798ms, rate sampling interval: 3026ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   544.70ms  144.41ms   1.74s    81.22%
    Req/Sec    49.81      6.12    61.00     86.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  502.02ms
 75.000%  605.70ms
 90.000%  748.03ms
 99.000%    1.08s 
 99.900%    1.56s 
 99.990%    1.74s 
 99.999%    1.74s 
100.000%    1.74s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     339.967     0.000000            1         1.00
     419.839     0.100000          500         1.11
     441.855     0.200000         1000         1.25
     461.823     0.300000         1504         1.43
     481.023     0.400000         2005         1.67
     502.015     0.500000         2501         2.00
     514.047     0.550000         2758         2.22
     527.871     0.600000         3004         2.50
     541.183     0.650000         3254         2.86
     561.663     0.700000         3504         3.33
     605.695     0.750000         3751         4.00
     625.151     0.775000         3875         4.44
     634.879     0.800000         4001         5.00
     653.823     0.825000         4127         5.71
     673.279     0.850000         4250         6.67
     707.071     0.875000         4377         8.00
     727.039     0.887500         4437         8.89
     748.543     0.900000         4501        10.00
     763.391     0.912500         4565        11.43
     773.119     0.925000         4625        13.33
     790.015     0.937500         4687        16.00
     798.719     0.943750         4718        17.78
     809.471     0.950000         4750        20.00
     823.295     0.956250         4782        22.86
     837.119     0.962500         4812        26.67
     849.919     0.968750         4844        32.00
     856.063     0.971875         4859        35.56
     868.863     0.975000         4875        40.00
     893.951     0.978125         4891        45.71
     907.775     0.981250         4906        53.33
     922.111     0.984375         4921        64.00
     961.535     0.985938         4929        71.11
    1008.127     0.987500         4937        80.00
    1037.311     0.989062         4945        91.43
    1113.087     0.990625         4953       106.67
    1141.759     0.992188         4960       128.00
    1169.407     0.992969         4964       142.22
    1214.463     0.993750         4969       160.00
    1217.535     0.994531         4972       182.86
    1254.399     0.995313         4976       213.33
    1324.031     0.996094         4980       256.00
    1355.775     0.996484         4982       284.44
    1383.423     0.996875         4984       320.00
    1402.879     0.997266         4986       365.71
    1451.007     0.997656         4988       426.67
    1496.063     0.998047         4990       512.00
    1497.087     0.998242         4991       568.89
    1516.543     0.998437         4992       640.00
    1553.407     0.998633         4993       731.43
    1555.455     0.998828         4994       853.33
    1571.839     0.999023         4995      1024.00
    1571.839     0.999121         4995      1137.78
    1572.863     0.999219         4996      1280.00
    1572.863     0.999316         4996      1462.86
    1582.079     0.999414         4997      1706.67
    1582.079     0.999512         4997      2048.00
    1582.079     0.999561         4997      2275.56
    1667.071     0.999609         4998      2560.00
    1667.071     0.999658         4998      2925.71
    1667.071     0.999707         4998      3413.33
    1667.071     0.999756         4998      4096.00
    1667.071     0.999780         4998      4551.11
    1742.847     0.999805         4999      5120.00
    1742.847     1.000000         4999          inf
#[Mean    =      544.696, StdDeviation   =      144.410]
#[Max     =     1741.824, Total count    =         4999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5900 requests in 1.00m, 5.13MB read
Requests/sec:     97.87
Transfer/sec:     87.07KB